// ใช้คำสั่ง push เพื่อเพิ่มชุดข้อสอบนี้เข้าไปในรายการรวม
allExamSets.push({
    id: "set8", // รหัสชุดข้อสอบ
    name: "8. แนวข้อสอบ ความรู้เกี่ยวกับวิสัยทัศน์ พันธกิจฯ อัยการสูงสุด", // ชื่อที่จะโชว์ในเมนู
    data: [
        {
            "category": "วิสัยทัศน์และพันธกิจ",
            "question": "ข้อใดคือวิสัยทัศน์สำนักงานอัยการสูงสุด",
            "options": [
                "เป็นองค์กรนําที่มุ่งส่งเสริมหลักนิติธรรมความเสมอภาค และเป็นธรรมตามมาตรฐานสากล",
                "เป็นองค์กรแห่งความยุติธรรมของสังคมเพื่อความมั่นคงของชาติและความผาสุกของประชาชน",
                "เป็นองค์กรนำในการอำนวยความยุติธรรมและสร้างความร่วมมือในระดับภูมิภาคเพื่อประโยชน์ สาธารณะ",
                "เป็นองค์กรที่ยกระดับมาตราฐานความยุติธรรมของประเทศเทียบเท่าระดับสากล"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. เป็นองค์กรแห่งความยุติธรรมของสังคมเพื่อความมั่นคงของชาติและความผาสุกของ ประชาชน"
        },
        {
            "category": "วิสัยทัศน์และพันธกิจ",
            "question": "พันธกิจของสำนักงานอัยการสูงสุดมีกี่ข้อ",
            "options": [
                "3 ข้อ",
                "4 ข้อ",
                "5 ข้อ",
                "6 ข้อ"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. 4 ข้อ (พันธกิจสำนักงานอัยการสูงสุดมี 4 ข้อ คือ 1.อำนวยความยุติธรรมให้มี ประสิทธิภาพ โปร่งใส พึ่งพิงได้บนพื้นฐานของความเสมอภาค 2.รักษาผลประโยชน์ของรัฐ เพื่อประโยชน์สาธารณะและการพัฒนาประเทศอย่างยั่งยืน 3.รับรู้ ดูแล แก้ปัญหาในการคุ้มครอง สิทธิ เสรีภาพ และเป็นที่พึ่งของประชาชนในด้านกฎหมาย 4.พัฒนาศักยภาพองค์กรให้เท่าทันการ เปลี่ยนแปลงของโลกบนฐานความเชี่ยวชาญ)"
        },
        {
            "category": "วิสัยทัศน์และพันธกิจ",
            "question": "ข้อใดไม่ใช่พันธกิจของสำนักงานอัยการสูงสุด",
            "options": [
                "อำนวยความยุติธรรมให้มีประสิทธิภาพ โปร่งใส พึ่งพิงได้บนพื้นฐานของความเสมอภาค",
                "รักษาผลประโยชน์ของรัฐ เพื่อประโยชน์สาธารณะและการพัฒนาประเทศอย่างยั่งยืน",
                "พัฒนาระบบงานยุติธรรมและการบังคับใช้กฎหมายให้เป็นไปตามหลักสากล",
                "รับรู้ ดูแล แก้ปัญหาในการคุ้มครองสิทธิ เสรีภาพ และเป็นที่พึ่งของประชาชนในด้านกฎหมาย"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. พัฒนาระบบงานยุติธรรมและการบังคับใช้กฎหมายให้เป็นไปตามหลักสากล"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "นโยบายอัยการสูงสุดมีกี่นโยบาย",
            "options": [
                "3 นโยบาย",
                "4 นโยบาย",
                "5 นโยบาย",
                "6 นโยบาย"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. 4 นโยบาย"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "ข้อใดไม่ใช่นโยบายอัยการสูงสุด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "บริหารจัดการอย่างยั่งยืน",
                "พัฒนาความร่วมมือ"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. พัฒนาความร่วมมือ"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "นายอิทธิพร แก้วทิพย์ อัยการสูงสุด แถลงนโยบายการบริหารงานภายใต้แนวคิดใด",
            "options": [
                "“PUBLIC TRUST”",
                "\"Easy Access to Justice\"",
                "“Virtuous Justice”",
                "“Justice for People”"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. “Justice for People” (ภายใต้แนวคิด “ยุติธรรมโปร่งใส ใส่ใจประชาชน เพิ่ม ประสิทธิผลของงาน บริหารจัดการอย่างยั่งยืน : Justice for People”)"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "พัฒนาประสิทธิภาพการดำเนินคดีให้รวดเร็ว โปร่งใส และเป็นธรรม อยู่ในนโยบายการบริหารงาน ของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. ยุติธรรมโปร่งใส"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "ลดปริมาณสำนวนค้าง อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. ยุติธรรมโปร่งใส"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "พัฒนาเทคโนโลยีดิจิทัลในการบริหารคดี อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. ยุติธรรมโปร่งใส"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "ส่งเสริมความร่วมมือเชิงรุกระหว่างสำนักงานอัยการสูงสุดกับหน่วยงานภาครัฐและเอกชนทั้งในและ ต่างประเทศ อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. ยุติธรรมโปร่งใส"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "สนับสนุนการบังคับใช้กฎหมายเกี่ยวกับการป้องกันและปราบปรามการทุจริตอย่างจริงจังเป็น รูปธรรมต่อเนื่อง อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. ยุติธรรมโปร่งใส"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "พัฒนางานคุ้มครองสิทธิเสรีภาพของประชาชน อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. ใส่ใจประชาชน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "เสริมสร้างความเข้าใจและความเชื่อมั่นของประชาชนต่อองค์กรอัยการผ่านการสื่อสารและการมี ส่วนร่วม อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. ใส่ใจประชาชน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "ปรับปรุงกระบวนการไกล่เกลี่ยข้อพิพาทให้ประชาชนเข้าถึงความยุติธรรมได้ง่ายขึ้น อยู่ในนโยบาย การบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. ใส่ใจประชาชน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "เพิ่มประสิทธิภาพการติดตามและบังคับคดีเพื่อรักษาผลประโยชน์สูงสุดของรัฐ อยู่ในนโยบายการ บริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. ใส่ใจประชาชน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "สนับสนุนการคุ้มครองเด็ก สตรี ผู้เสียหาย และผู้ต้องหาในกระบวนการยุติธรรม อยู่ในนโยบายการ บริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. ใส่ใจประชาชน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "พัฒนาหลักสูตรการฝึกอบรมเพื่อเพิ่มศักยภาพบุคลากรทุกระดับ (Upskill/ Reskill) อยู่ในนโยบาย การบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. เพิ่มประสิทธิผลของงาน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "พัฒนาและปรับปรุงระบบเทคโนโลยีสารสนเทศเพื่อสนับสนุนการทำงานที่รวดเร็วโปร่งใส และ ตรวจสอบได้ อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. เพิ่มประสิทธิผลของงาน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "ลดขั้นตอนการทำงานให้เกิดความรวดเร็ว อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. เพิ่มประสิทธิผลของงาน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "เสริมสร้างแนวคิดและทัศนคติของบุคลากรให้มุ่งเน้นความรับผิดชอบและประสิทธิภาพการทำงาน เพื่อสนองตอบต่อประชาชน อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. เพิ่มประสิทธิผลของงาน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "สร้างมาตรฐานจริยธรรมและธรรมาภิบาลของบุคลากรอย่างเคร่งครัด อยู่ในนโยบายการบริหารงาน ของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. เพิ่มประสิทธิผลของงาน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "สร้างมาตรฐานการปฏิบัติงานให้เป็นรูปธรรมภายใต้แผนการบริหารความเปลี่ยนแปลง อยู่ใน นโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. บริหารจัดการอย่างยั่งยืน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "สร้างความเชี่ยวชาญเฉพาะด้านให้แก่พนักงานอัยการ อยู่ในนโยบายการบริหารงานของอัยการ สูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. บริหารจัดการอย่างยั่งยืน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "เพิ่มช่องทางให้บุคลากรมีส่วนร่วมในการเสนอความคิดเห็นหรือแนวคิดในการพัฒนาสำนักงาน อัยการสูงสุด อยู่ในนโยบายการบริหารงานของอัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. บริหารจัดการอย่างยั่งยืน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "ส่งเสริมการใช้พลังงานสะอาดและแนวคิดสำนักงานสีเขียว อยู่ในนโยบายการบริหารงานของอัยการ สูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. บริหารจัดการอย่างยั่งยืน"
        },
        {
            "category": "นโยบายอัยการสูงสุด",
            "question": "ขับเคลื่อนการบริหารงบประมาณให้มีประสิทธิภาพและต่อเนื่อง อยู่ในนโยบายการบริหารงานของ อัยการสูงสุดข้อใด",
            "options": [
                "ยุติธรรมโปร่งใส",
                "ใส่ใจประชาชน",
                "เพิ่มประสิทธิผลของงาน",
                "บริหารจัดการอย่างยั่งยืน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. บริหารจัดการอย่างยั่งยืน"
        },
        {
            "category": "แผนและยุทธศาสตร์",
            "question": "แผนปฏิบัติราชการของสำนักงานอัยการสูงสุด มีระยะเวลากี่ปี",
            "options": [
                "3 ปี",
                "4 ปี",
                "5 ปี",
                "6 ปี"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. 5 ปี"
        },
        {
            "category": "แผนและยุทธศาสตร์",
            "question": "แผนปฏิบัติราชการของสำนักงานอัยการสูงสุด เริ่มต้นและสิ้นสุดในปีใด",
            "options": [
                "พ.ศ. 2566 – 2569",
                "พ.ศ. 2566 – 2570",
                "พ.ศ. 2568 – 2571",
                "พ.ศ. 2568 – 2572"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. พ.ศ. 2566 – 2570"
        },
        {
            "category": "แผนและยุทธศาสตร์",
            "question": "ยุทธศาสตร์การพัฒนาองค์กรอัยการ กำหนดไว้กี่ปี",
            "options": [
                "10 ปี",
                "15 ปี",
                "20 ปี",
                "25 ปี"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. 15 ปี"
        },
        {
            "category": "แผนและยุทธศาสตร์",
            "question": "ยุทธศาสตร์การพัฒนาองค์กรอัยการ เริ่มต้นและสิ้นสุดในปีใด",
            "options": [
                "พ.ศ. 2561 – 2580",
                "พ.ศ. 2561 – 2575",
                "พ.ศ. 2566 – 2580",
                "พ.ศ. 2566 – 2585"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. พ.ศ. 2566 – 2580"
        },
        {
            "category": "แผนและยุทธศาสตร์",
            "question": "ยุทธศาสตร์การพัฒนาองค์กรอัยการ ได้กำหนดเป้าหมายการพัฒนาองค์กรอัยการไว้เป็นกี่ระยะ",
            "options": [
                "2 ระยะ",
                "3 ระยะ",
                "4 ระยะ",
                "5 ระยะ"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. 3 ระยะ (ระยะที ่ 1: พ.ศ. 2566 – 2570 ระยะที่ 2: พ.ศ. 2571 – 2575 ระยะที่ 3: พ.ศ. 2576 – 2580)"
        },
        {
            "category": "วิสัยทัศน์องค์กร",
            "question": "ข้อใดคือวิสัยทัศน์การพัฒนาองค์กรอัยการ ระยะ 15 ปี",
            "options": [
                "เป็นองค์กรนําที่มุ่งส่งเสริมหลักนิติธรรมความเสมอภาค และเป็นธรรมตามมาตรฐานสากล",
                "เป็นองค์กรแห่งความยุติธรรมของสังคมเพื่อความมั่นคงของชาติและความผาสุกของประชาชน",
                "เป็นองค์กรนำในการอำนวยความยุติธรรมและสร้างความร่วมมือในระดับภูมิภาคเพื่อประโยชน์ สาธารณะ",
                "เป็นองค์กรที่ยกระดับมาตรฐานความยุติธรรมของประเทศเทียบเท่าระดับสากล"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. เป็นองค์กรนําที่มุ่งส่งเสริมหลักนิติธรรมความเสมอภาค และเป็นธรรมตาม มาตรฐานสากล"
        },
        {
            "category": "วิสัยทัศน์องค์กร",
            "question": "ข้อใดคือวิสัยทัศน์การพัฒนาองค์กรอัยการ ระยะที่ 1 พ.ศ. 2566 – 2570",
            "options": [
                "เป็นองค์กรนําที่มุ่งส่งเสริมหลักนิติธรรมความเสมอภาค และเป็นธรรมตามมาตรฐานสากล",
                "เป็นองค์กรแห่งความยุติธรรมของสังคมเพื่อความมั่นคงของชาติและความผาสุกของประชาชน",
                "เป็นองค์กรนำในการอำนวยความยุติธรรมและสร้างความร่วมมือในระดับภูมิภาคเพื่อประโยชน์ สาธารณะ",
                "เป็นองค์กรที่ยกระดับมาตรฐานความยุติธรรมของประเทศเทียบเท่าระดับสากล"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. เป็นองค์กรแห่งความยุติธรรมของสังคมเพื่อความมั่นคงของชาติและความผาสุกของ ประชาชน"
        },
        {
            "category": "วิสัยทัศน์องค์กร",
            "question": "ข้อใดคือวิสัยทัศน์การพัฒนาองค์กรอัยการ ระยะที่ 2 พ.ศ. 2571 – 2575",
            "options": [
                "เป็นองค์กรนําที่มุ่งส่งเสริมหลักนิติธรรมความเสมอภาค และเป็นธรรมตามมาตรฐานสากล",
                "เป็นองค์กรแห่งความยุติธรรมของสังคมเพื่อความมั่นคงของชาติและความผาสุกของประชาชน",
                "เป็นองค์กรนำในการอำนวยความยุติธรรมและสร้างความร่วมมือในระดับภูมิภาคเพื่อประโยชน์ สาธารณะ",
                "เป็นองค์กรที่ยกระดับมาตรฐานความยุติธรรมของประเทศเทียบเท่าระดับสากล"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. เป็นองค์กรนำในการอำนวยความยุติธรรมและสร้างความร่วมมือในระดับภูมิภาคเพื่อ ประโยชน์สาธารณะ"
        },
        {
            "category": "วิสัยทัศน์องค์กร",
            "question": "ข้อใดคือวิสัยทัศน์การพัฒนาองค์กรอัยการ ระยะที่ 3 พ.ศ. 2576 – 2580",
            "options": [
                "เป็นองค์กรนําที่มุ่งส่งเสริมหลักนิติธรรมความเสมอภาค และเป็นธรรมตามมาตรฐานสากล",
                "เป็นองค์กรแห่งความยุติธรรมของสังคมเพื่อความมั่นคงของชาติและความผาสุกของประชาชน",
                "เป็นองค์กรนำในการอำนวยความยุติธรรมและสร้างความร่วมมือในระดับภูมิภาคเพื่อประโยชน์สาธารณะ",
                "เป็นองค์กรที่ยกระดับมาตรฐานความยุติธรรมของประเทศเทียบเท่าระดับสากล"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. เป็นองค์กรที่ยกระดับมาตรฐานความยุติธรรมของประเทศเทียบเท่าระดับสากล"
        },
        {
            "category": "ตราสัญลักษณ์",
            "question": "ข้อใดไม่ใช่องค์ประกอบตราสัญลักษณ์สำนักงานอัยการสูงสุด",
            "options": [
                "พระมหาพิชัยมงกุฎ",
                "พระแว่น พระสุริยกานต์",
                "ตราชูรูปพระขรรค์",
                "ดอกบัว"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. ดอกบัว (เครื่องหมายราชการ และเครื่องหมายแสดงสังกัดของสำนักงานอัยการสูงสุด รูปพระมหาพิชัยมงกุฎประดิษฐานเหนือพระแว่น พระสุริยกานต์ และตราชูรูปพระขรรค์ รองรับ ด้วยช่อชัยพฤกษ์ มีความหมายถึงอำนาจหน้าที่ในการเป็นทนายแผ่นดิน การใช้กฎหมายด้วยความ รอบคอบ เป็นธรรม และเด็ดขาด มีชัยชนะเหนืออธรรม)"
        },
        {
            "category": "ค่านิยมร่วม (PUBLIC)",
            "question": "ค่านิยมร่วมตัว 'P' ในความหมายของสำนักงานอัยการสูงสุดคืออะไร",
            "options": [
                "เป็นที่พึ่งความยุติธรรม",
                "ประชาชนมาที่หนึ่ง",
                "คิดและทำเพื่อพัฒนา",
                "รักษากฎหมายด้วยเหตุผล"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. ประชาชนมาที่หนึ่ง (ค่านิยมร่วมของสำนักงานอัยการสูงสุด “PUBLIC” ตัว P : People First ประชาชนมาที่หนึ่ง)"
        },
        {
            "category": "ค่านิยมร่วม (PUBLIC)",
            "question": "ค่านิยมร่วมตัว 'U' ในความหมายของสำนักงานอัยการสูงสุดคืออะไร",
            "options": [
                "เป็นที่พึ่งความยุติธรรม",
                "ประชาชนมาที่หนึ่ง",
                "คิดและทำเพื่อพัฒนา",
                "รักษากฎหมายด้วยเหตุผล"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. เป็นที่พึ่งความยุติธรรม ((ค่านิยมร่วมของสำนักงานอัยการสูงสุด “PUBLIC” ตัว U : Uprightness เป็นที่พึ่งความยุติธรรม)"
        },
        {
            "category": "ค่านิยมร่วม (PUBLIC)",
            "question": "ค่านิยมร่วมตัว 'B' ในความหมายของสำนักงานอัยการสูงสุดคืออะไร",
            "options": [
                "เป็นที่พึ่งความยุติธรรม",
                "ประชาชนมาที่หนึ่ง",
                "คิดและทำเพื่อพัฒนา",
                "รักษากฎหมายด้วยเหตุผล"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. คิดและทำเพื่อพัฒนา ((ค่านิยมร่วมของสำนักงานอัยการสูงสุด “PUBLIC” ตัว B : Betterment คิดและทำเพื่อพัฒนา)"
        },
        {
            "category": "ค่านิยมร่วม (PUBLIC)",
            "question": "ค่านิยมร่วมตัว 'L' ในความหมายของสำนักงานอัยการสูงสุดคืออะไร",
            "options": [
                "คิดและทำเพื่อพัฒนา",
                "รักษากฎหมายด้วยเหตุผล",
                "ประพฤติตนซื่อสัตย์และโปร่งใส",
                "ร่วมมือร่วมใจสู่เป้าหมาย"
            ],
            "correct": 1,
            "explanation": "เฉลยข้อ ข. รักษากฎหมายด้วยเหตุผล ((ค่านิยมร่วมของสำนักงานอัยการสูงสุด “PUBLIC” ตัว L : Lawfulness รักษากฎหมายด้วยเหตุผล)"
        },
        {
            "category": "ค่านิยมร่วม (PUBLIC)",
            "question": "ค่านิยมร่วมตัว 'I' ในความหมายของสำนักงานอัยการสูงสุดคืออะไร",
            "options": [
                "คิดและทำเพื่อพัฒนา",
                "รักษากฎหมายด้วยเหตุผล",
                "ประพฤติตนซื่อสัตย์และโปร่งใส",
                "ร่วมมือร่วมใจสู่เป้าหมาย"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. ประพฤติตนซื่อสัตย์และโปร่งใส ((ค่านิยมร่วมของสำนักงานอัยการสูงสุด “PUBLIC” ตัว I : Integrity ประพฤติตนซื่อสัตย์และโปร่งใส)"
        },
        {
            "category": "ค่านิยมร่วม (PUBLIC)",
            "question": "ค่านิยมร่วมตัว 'C' ในความหมายของสำนักงานอัยการสูงสุดคืออะไร",
            "options": [
                "คิดและทำเพื่อพัฒนา",
                "รักษากฎหมายด้วยเหตุผล",
                "ประพฤติตนซื่อสัตย์และโปร่งใส",
                "ร่วมมือร่วมใจสู่เป้าหมาย"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. ร่วมมือร่วมใจสู่เป้าหมาย ((ค่านิยมร่วมของสำนักงานอัยการสูงสุด “PUBLIC” ตัว C : Collaboration ร่วมมือร่วมใจสู่เป้าหมาย)"
        },
        {
            "category": "โครงสร้างและบุคลากร",
            "question": "อัยการสูงสุดคนปัจจุบันมีชื่อว่าอะไร",
            "options": [
                "นายวุฒิพงศ์ วิบูลย์วงศ์",
                "นายอำนาจ เจตน์เจริญรักษ์",
                "นายไพรัช พรสมบูรณ์ศิริ",
                "นายอิทธิพร แก้วทิพย์"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. นายอิทธิพร แก้วทิพย์ (อัยการสูงสุดคนที่ 20)"
        },
        {
            "category": "โครงสร้างและบุคลากร",
            "question": "ประธานคณะกรรมการอัยการคนปัจจุบันมีชื่อว่าอะไร",
            "options": [
                "นายวุฒิพงศ์ วิบูลย์วงศ์",
                "นายอำนาจ เจตน์เจริญรักษ์",
                "นายไพรัช พรสมบูรณ์ศิริ",
                "นายอิทธิพร แก้วทิพย์"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. นายวุฒิพงศ์ วิบูลย์วงศ์"
        },
        {
            "category": "โครงสร้างและบุคลากร",
            "question": "รองอัยการสูงสุดมีกี่คน",
            "options": [
                "5 คน",
                "6 คน",
                "7 คน",
                "8 คน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. 8 คน"
        },
        {
            "category": "โครงสร้างและบุคลากร",
            "question": "ผู้ตรวจการอัยการมีกี่คน",
            "options": [
                "6 คน",
                "7 คน",
                "8 คน",
                "9 คน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. 9 คน"
        },
        {
            "category": "อำนาจและหน้าที่",
            "question": "ข้อใดเป็นอำนาจและหน้าที่ของสำนักงานอัยการสูงสุด",
            "options": [
                "ให้ความช่วยเหลือประชาชนในการดำเนินการทางกฎหมายรวมตลอดทั้งในการคุ้มครองป้องกันสิทธิ และเสรีภาพของประชาชน",
                "ให้คำปรึกษา และตรวจร่างสัญญาหรือเอกสารทางกฎหมายให้แก่รัฐบาล และหน่วยงานของรัฐ",
                "ให้คำปรึกษา และตรวจร่างสัญญาหรือเอกสารทางกฎหมายให้แก่นิติบุคคล ซึ่งมิใช่หน่วยงานของรัฐ แต่ได้มีพระราชบัญญัติหรือพระราชกฤษฎีกาจัดตั้งขึ้น ทั้งนี้ ตามที่เห็นสมควร",
                "ถูกทุกข้อ"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. ถูกทุกข้อ"
        },
        {
            "category": "อำนาจและหน้าที่",
            "question": "ข้อใดเป็นอำนาจและหน้าที่ของสำนักงานอัยการสูงสุด",
            "options": [
                "ดำเนินการเกี่ยวกับการบังคับคดีแพ่ง หรือคดีปกครองแทนรัฐบาล หรือหน่วยงานของรัฐซึ่งพนักงาน อัยการได้รับดำเนินคดีให้",
                "ดำเนินการตามที่รัฐมนตรีร้องขอ เว้นแต่การดำเนินการนั้นจะขัดต่องานในหน้าที่ หรืออาจทำให้ขัดต่อ ความเป็นอิสระในการปฏิบัติหน้าที่ของพนักงานอัยการ",
                "ดำเนินการเกี่ยวกับการฝึกอบรมเพื่อประโยชน์ในการพัฒนาข้าราชการฝ่ายอัยการ",
                "ถูกทุกข้อ"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. ถูกทุกข้อ"
        },
        {
            "category": "อำนาจและหน้าที่",
            "question": "ข้อใดไม่ใช่อำนาจและหน้าที่ของสำนักงานอัยการสูงสุด",
            "options": [
                "ให้ความร่วมมือกับหน่วยงานของรัฐในการอำนวยความยุติธรรม การรักษาผลประโยชน์ของรัฐและประชาชน",
                "ติดต่อและประสานงานกับองค์กรหรือหน่วยงานต่างประเทศเกี่ยวกับเรื่องที่อยู่ในอำนาจและหน้าที่ ของพนักงานอัยการหรือสำนักงานอัยการสูงสุด",
                "ปฏิบัติการอื่นใดตามที่กฎหมายกำหนดให้เป็นอำนาจและหน้าที่ของพนักงานอัยการหรือสำนักงาน อัยการสูงสุด",
                "ออกคำสั่งเรียกบุคคลใด ๆ ที่เกี่ยวข้องมาให้ถ้อยคำก็ได้ แต่จะเรียกคู่ความอีกฝ่ายหนึ่งมาให้ถ้อยคำโดย คู่ความฝ่ายนั้นไม่ยินยอมไม่ได้"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. ออกคำสั่งเรียกบุคคลใด ๆ ที่เกี่ยวข้องมาให้ถ้อยคำก็ได้ แต่จะเรียกคู่ความอีกฝ่ายหนึ่ง มาให้ถ้อยคำโดยคู่ความฝ่ายนั้นไม่ยินยอมไม่ได้ (ข้อนี้เป็นอำนาจหน้าที่ของพนักงานอัยการตาม พ.ร.บ.องค์กรอัยการและพนักงานอัยการ พ.ศ. 2553 มาตรา 14)"
        },
        {
            "category": "อำนาจและหน้าที่",
            "question": "ข้อใดเป็นอำนาจหน้าที่ของพนักงานอัยการ",
            "options": [
                "อำนาจและหน้าที่ตามรัฐธรรมนูญ",
                "ในคดีอาญา มีอำนาจและหน้าที่ตามประมวลกฎหมายวิธีพิจารณาความอาญาและตามกฎหมายอื่นซึ่ง บัญญัติว่าเป็นอำนาจและหน้าที่ของสำนักงานอัยการสูงสุดหรือพนักงานอัยการ",
                "ในคดีแพ่ง หรือคดีปกครอง มีอำนาจและหน้าที่ดำเนินคดีแทนรัฐบาล",
                "ถูกทุกข้อ"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. ถูกทุกข้อ"
        },
        {
            "category": "อำนาจและหน้าที่",
            "question": "ข้อใดเป็นอำนาจหน้าที่ของพนักงานอัยการ",
            "options": [
                "ในคดีที่ราษฎรฟ้องเองไม่ได้โดยกฎหมายห้าม เมื่อเห็นสมควรพนักงานอัยการมีอำนาจเป็นโจทก์ได้",
                "ดำเนินการตามที่เห็นสมควรเกี่ยวกับการบังคับคดีอาญาเฉพาะในส่วนของการยึดทรัพย์สินใช้ค่าปรับ ตามคำพิพากษา ในการนี้มิให้เรียกค่าฤชาธรรมเนียมจากพนักงานอัยการ",
                "ในกรณีที่มีการผิดสัญญาประกันจำเลย หรือประกันรับสิ่งของไปดูแลรักษา ตามประมวลกฎหมายวิธี พิจารณาความอาญา มีอำนาจและหน้าที่ดำเนินคดีในการบังคับให้เป็นไปตามสัญญานั้น ในการนี้มิให้ เรียกค่าฤชาธรรมเนียมจากพนักงานอัยการ",
                "ถูกทุกข้อ"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. ถูกทุกข้อ"
        },
        {
            "category": "อำนาจและหน้าที่",
            "question": "ข้อใดไม่ใช่อำนาจหน้าที่ของพนักงานอัยการ",
            "options": [
                "อำนาจและหน้าที่ตาม ก.อ. ประกาศกำหนดหรือเห็นชอบเพื่อปฏิบัติให้เป็นไปตามกฎหมาย หรือมติ คณะรัฐมนตรี",
                "ปฏิบัติหน้าที่อื่นตามที่กฎหมายกำหนดให้เป็นอำนาจและหน้าที่ของพนักงานอัยการ",
                "รายงานรัฐบาล หรือหน่วยงานของรัฐที่เป็นคู่สัญญาให้ทราบถึงข้อที่ควรปรับปรุงหรือแก้ไขให้สมบูรณ์ ข้อเสียเปรียบหรือข้อที่อาจก่อให้เกิดความเสียหายแก่รัฐ",
                "ไม่มีข้อใดถูก"
            ],
            "correct": 2,
            "explanation": "เฉลยข้อ ค. รายงานรัฐบาล หรือหน่วยงานของรัฐที่เป็นคู่สัญญาให้ทราบถึงข้อที่ควรปรับปรุงหรือ แก้ไขให้สมบูรณ์ ข้อเสียเปรียบหรือข้อที่อาจก่อให้เกิดความเสียหายแก่รัฐ (ข้อนี้เป็นอำนาจหน้าที่ ของสำนักงานอัยการสูงสุด)"
        },
        {
            "category": "โครงสร้างและบุคลากร",
            "question": "เลขาธิการสำนักงานอัยการสูงสุดคนปัจจุบันมีชื่อว่าอะไร",
            "options": [
                "นายสราวุธ ปิตุเตชะ",
                "นายรัชต์เทพ ดีประหลาด",
                "นายรุ่งโรจน์ แจ่มพิทยากรณ์",
                "นายสถิรภาค อ่อวิเชียร"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. นายสราวุธ ปิตุเตชะ"
        },
        {
            "category": "โครงสร้างหน่วยงาน",
            "question": "สำนักงานอัยการสูงสุดเป็นส่วนราชการมีหน่วยงานราชการภายในแบ่งออกเป็นกี่หน่วยงาน ตาม ประกาศคณะกรรมการอัยการ เรื่อง การแบ่งหน่วยงาน และการกำหนดอำนาจและหน้าที่ ของหน่วยงานภายในของสำนักงานอัยการสูงสุด พ.ศ. ๒๕๖๓",
            "options": [
                "2 ประเภท",
                "3 ประเภท",
                "4 ประเภท",
                "5 ประเภท"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. 2 ประเภท (ตามประกาศคณะกรรมการอัยการ เรื่อง การแบ่งหน่วยงาน และการ กำหนดอำนาจและหน้าที่ของหน่วยงานภายในของสำนักงานอัยการสูงสุด พ.ศ. ๒๕๖๓ กำหนดให้ แบ่งส่วนราชการภายในเป็น 1.หน่วยงานราชการอัยการ 2.หน่วยงานราชการธุรการ)"
        },
        {
            "category": "โครงสร้างหน่วยงาน",
            "question": "กำหนดให้แบ่งหน่วยงานราชการอัยการออกเป็นกี่หน่วยงาน ตามประกาศคณะกรรมการอัยการ เรื่อง การแบ่งหน่วยงาน และการกำหนดอำนาจและหน้าที่ของหน่วยงานภายในของสำนักงานอัยการ สูงสุด พ.ศ. ๒๕๖๓",
            "options": [
                "2 หน่วยงาน",
                "33 หน่วยงาน",
                "47 หน่วยงาน",
                "61 หน่วยงาน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. 61 หน่วยงาน"
        },
        {
            "category": "โครงสร้างหน่วยงาน",
            "question": "กำหนดให้แบ่งหน่วยงานราชการธุรการออกเป็นกี่หน่วยงาน ตามประกาศคณะกรรมการอัยการ เรื่อง การแบ่งหน่วยงาน และการกำหนดอำนาจและหน้าที่ของหน่วยงานภายในของสำนักงานอัยการ สูงสุด พ.ศ. ๒๕๖๓",
            "options": [
                "2 หน่วยงาน",
                "33 หน่วยงาน",
                "47 หน่วยงาน",
                "61 หน่วยงาน"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. 2 หน่วยงาน (ข้อ ๙ ให้แบ่งหน่วยงานราชการธุรการ ออกเป็น 2 หน่วยงาน คือ (๑) สำนักงานเลขาธิการสำนักงานอัยการสูงสุด (๒) สำนักงานตรวจสอบภายใน)"
        },
        {
            "category": "โครงสร้างหน่วยงาน",
            "question": "ข้อใดไม่ใช่หน่วยงานราชการอัยการ",
            "options": [
                "สำนักงานเลขาธิการสำนักงานอัยการสูงสุด",
                "สถาบันนิติวัชร์",
                "สำนักงานบริหารและสนับสนุนงานอัยการสูงสุด",
                "สำนักงานคณะกรรมการอัยการ"
            ],
            "correct": 0,
            "explanation": "เฉลยข้อ ก. สำนักงานเลขาธิการสำนักงานอัยการสูงสุด (สำนักงานเลขาธิการสำนักงานอัยการสูงสุด เป็น หน่วยงานราชการธุรการ)"
        },
        {
            "category": "โครงสร้างหน่วยงาน",
            "question": "ข้อใดเป็นหน่วยงานราชการธุรการ",
            "options": [
                "สำนักงานวิชาการ",
                "สำนักงานที่ปรึกษากฎหมาย",
                "สำนักงานต่างประเทศ",
                "สำนักงานตรวจสอบภายใน"
            ],
            "correct": 3,
            "explanation": "เฉลยข้อ ง. สำนักงานตรวจสอบภายใน (ข้อ ก-ข-ค เป็นหน่วยงานราชการอัยการ)"
        }
    ]
});